<template>
  <div class="home">
    <div class="header">
      <h1>Добро пожаловать!</h1>
      <h2>Приложение для идентификации сотрудников компании на КПП</h2>
      <p>Организация безопасности объектов стала проще с нашим приложением</p>
    </div>
    <div class="project-details">
      <h3>Краткое описание проекта</h3>
      <p>Приложение для идентификации сотрудников компании на КПП. Разрабатываемый программный продукт позволяет сотруднику СБ быстро и качественно организовывать мероприятия по обеспечению безопасности на объектах.</p>
    </div>
    <div class="domain-analysis">
      <h3>Краткое описание предметной области</h3>
      <p>Предметной областью является сфера безопасности (в частности, организация безопасности каких-либо объектов).</p>
    </div>
    <div class="analogs-analysis">
      <h3>Краткий анализ аналогичных решений</h3>
      <!-- Таблица с анализом аналогичных решений -->
    </div>
    <div class="justification">
      <h3>Краткое обоснование целесообразности и актуальности проекта</h3>
      <p>В современном мире такая система является очень актуальной и востребованной, так как всегда необходимо поддерживать безопасность в абсолютно разных областях и местах.</p>
    </div>
    <div class="user-roles">
      <h3>Краткое описание акторов (ролей)</h3>
      <!-- Описание ролей пользователей -->
    </div>
    <div class="use-cases">
      <h3>Сценарии использования</h3>
      <!-- Описание сценариев использования -->
    </div>
    <div class="tech-stack">
      <h3>Описание типа приложения и выбранного технологического стека</h3>
      <!-- Описание типа приложения и технологического стека -->
    </div>
  </div>
</template>

<script>
export default {
  name: 'HomePage',
  // Добавьте логику, если необходимо
};
</script>

<style scoped>
/* Стили для домашней страницы */
.home {
  max-width: 800px;
  margin: 0 auto;
  padding: 20px;
}

.header {
  text-align: center;
  margin-bottom: 40px;
}

.project-details,
.domain-analysis,
.analogs-analysis,
.justification,
.user-roles,
.use-cases,
.tech-stack {
  margin-bottom: 40px;
}
</style>
